In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Book1.csv')

In [3]:
df.head()

     name  mobile_no result
0  gudiya       1234   pass
1    attu       3453   pass
2  Rohit       35567   pass
3    lali       6865   pass
4    lalo       6978   pass

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       5 non-null      object
 1   mobile_no  5 non-null      int64
 2   result     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [6]:
for x in df['result']:
    if 'fail' in x:
        print('IT CONTAINS FAIL')
    else:
        print('PASS')

PASS
PASS
PASS
PASS
PASS

In [10]:
df2 = pd.read_csv('Book2.csv')

In [11]:
df2

     name  mobile_no result
0  gudiya       1234   fail
1    attu       3453   pass
2  Rohit       35567   pass
3    lali       6865   pass
4    lalo       6978   pass

In [12]:
for x in df2['result']:
    if 'fail' in x:
        print('IT CONTAINS FAIL')
    else:
        print('PASS')

IT CONTAINS FAIL
PASS
PASS
PASS
PASS

In [13]:
if any(df['result'].str.contains('fail')):
    print('IT CONTAINS FAIL')
else:
    print('PASS')

PASS

In [14]:
if any(df2['result'].str.contains('fail')):
    print('IT CONTAINS FAIL')
else:
    print('PASS')

IT CONTAINS FAIL

## Task 2...

In [15]:
merged_df = pd.concat([df, df2])

merged_df = merged_df.drop_duplicates()

print(merged_df)

     name  mobile_no result
0  gudiya       1234   pass
1    attu       3453   pass
2  Rohit       35567   pass
3    lali       6865   pass
4    lalo       6978   pass
0  gudiya       1234   fail